


#魔法药品:
magic_durgs_dict = {
    #名称:[增加值,多少钱,库存]
    "小魔瓶":[10, 100, 10],
    "中魔瓶":[50, 150, 10],
    "大魔瓶":[100, 200, 10],
}

#生命药品:
life_durgs_dict = {
    #名称:[增加值,多少钱,库存]
    "小血瓶":[10, 100, 10],
    "中血瓶":[50, 150, 10],
    "大血瓶":[100, 200, 10],
}


#武器:
weapon_dict = {
    #名称:[攻击力,多少钱,库存]
    "青龙偃月刀":[100,1000,10],
    "丈八蛇矛":[100,1000,10],
    "双剑":[100,1000,10],
    "方天画戟":[150,2000,10],
}

#经验与级别:
leve_and_experience_list = [
    #级别:经验值
    [0,500],
    [500,1000],
    [1000,5000],
    [5000,20000],
]

#我的技能:

skill_list = [
    #级别1-4:技能,攻击力,魔法消耗
    ["小招1",100,20],
    ["小招2",150,20],
    ["小招3",100,20],
    ["大招",200,50],
]